{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "apple": 5,
      "banana": 6,
      "car": 7,
      "dog": 8,
      "elephant": 9,
      "flower": 10,
      "giraffe": 11,
      "happy": 12,
      "ice": 13,
      "jungle": 14,
      "the": 15,
      "a": 16,
      "an": 17,
      "and": 18,
      "or": 19,
      "but": 20,
      "is": 21,
      "are": 22,
      "was": 23,
      "were": 24,
      "this": 25,
      "that": 26,
      "these": 27,
      "those": 28,
      "good": 29,
      "bad": 30,
      "great": 31,
      "terrible": 32,
      "love": 33,
      "hate": 34,
      "movie": 35,
      "film": 36,
      "book": 37,
      "story": 38,
      "review": 39,
      "positive": 40,
      "negative": 41,
      "neutral": 42,
      "text": 43,
      "word": 44,
      "sentence": 45,
      "language": 46,
      "model": 47,
      "data": 48
    },
    "unk_token": "[UNK]"
  }
}